

# **Assignment 1**


# Q1:
Generate a DataFrame with four columns ('Name', 'Age', 'Gender', 'City') and five rows of sample data.

In [1]:
import pandas as pd
import numpy as np

In [2]:

# Code Here
#let create dataframe using Dict
dict_data = {
    "Name" : ["Ali","Ahmed","Aleesha","Asim","Ayesha"],
    "Age"  : [12,11,7,6,2],
    "Gender" : ["Male","Male","Female","Male","Female"],
    "City"   : ["Mecca","Madina","Istanbul","venus","Islamabad"]
}
data = pd.DataFrame(dict_data)

data

      Name  Age  Gender       City
0      Ali   12    Male      Mecca
1    Ahmed   11    Male     Madina
2  Aleesha    7  Female   Istanbul
3     Asim    6    Male      venus
4   Ayesha    2  Female  Islamabad

# Q2:
 **Create a Series:** Create a Series containing the names of your favorite movies and their corresponding ratings (out of 10).

In [3]:
# Code Here
movies = [" Farouk Omar", "The Lion of Desert","Men of Anjolos","Journery to Makkah"]
ratings = [9.3,8.2,7.1,7.3]
movie_series = pd.Series(ratings,index=movies,name="Favourite movies with Ratings")
print(movie_series)

 Farouk Omar          9.3
The Lion of Desert    8.2
Men of Anjolos        7.1
Journery to Makkah    7.3
Name: Favourite movies with Ratings, dtype: float64

# Q3:

**Index Labeling:** Set custom row labels for the DataFrame created in question 1, using meaningful identifiers instead of default numerical indices.

In [4]:
# code Here
data.index = ['Row 1',"Row 2","Row 3","Row 4","Row 5"]
data

          Name  Age  Gender       City
Row 1      Ali   12    Male      Mecca
Row 2    Ahmed   11    Male     Madina
Row 3  Aleesha    7  Female   Istanbul
Row 4     Asim    6    Male      venus
Row 5   Ayesha    2  Female  Islamabad

# Q4:

**Row Labeling:** Assign unique identifiers to the rows in the DataFrame created in question 1, such as 'Person1', 'Person2', etc.

In [5]:
data.index= ["Person 1","Person 2","Person 3","Person 4","Person 5"]

In [6]:
print(data)

             Name  Age  Gender       City
Person 1      Ali   12    Male      Mecca
Person 2    Ahmed   11    Male     Madina
Person 3  Aleesha    7  Female   Istanbul
Person 4     Asim    6    Male      venus
Person 5   Ayesha    2  Female  Islamabad

# Q5:

**Accessing Data:** Extract the 'Name' column from the DataFrame created in question 1 and display it in the Jupyter Notebook. Then, access the rating of your favorite movie from the Series created in question 2

In [7]:
print("The Name column is :: \n",data["Name"])

The Name column is ::
 Person 1        Ali
Person 2      Ahmed
Person 3    Aleesha
Person 4       Asim
Person 5     Ayesha
Name: Name, dtype: object

In [8]:
print(f"The Ratings of the movie 'Men of Anjolos' is {movie_series['Men of Anjolos']}")

The Ratings of the movie 'Men of Anjolos' is 7.1